# A Brief Introduction to Pandas
### Wrangling data with Python

In this notebook, we will cover the basics of Pandas, a dynamic, powerful Python library that is ubqiquitous in the field of Data Science. It has robust I/O functionality and makes wrangling.

In [4]:
import pandas as pd

## 1.1 Introduction
To start, let's read in some existing data using Pandas convenient read_csv method.

In [5]:
unemployment_df = pd.read_csv('./data/unemployment_2016.csv')

In [6]:
type(unemployment_df)

pandas.core.frame.DataFrame

Now let's select a single column of the dataframe.

In [7]:
countries = unemployment_df['country']

In [8]:
type(countries)

pandas.core.series.Series

## 1.2 Operations are vectorized
In Pandas, operations work on each value in most data structures, such as dataframes and series.

In [9]:
countries + " is in Europe."

0            Austria is in Europe.
1            Belgium is in Europe.
2           Bulgaria is in Europe.
3        Switzerland is in Europe.
4             Cyprus is in Europe.
5            Czechia is in Europe.
6            Germany is in Europe.
7            Denmark is in Europe.
8            Estonia is in Europe.
9             Greece is in Europe.
10             Spain is in Europe.
11           Finland is in Europe.
12            France is in Europe.
13           Croatia is in Europe.
14           Hungary is in Europe.
15           Ireland is in Europe.
16           Iceland is in Europe.
17             Italy is in Europe.
18         Lithuania is in Europe.
19        Luxembourg is in Europe.
20            Latvia is in Europe.
21             Malta is in Europe.
22       Netherlands is in Europe.
23            Norway is in Europe.
24            Poland is in Europe.
25          Portugal is in Europe.
26           Romania is in Europe.
27            Sweden is in Europe.
28          Slovenia is in Europe.
29          Slovakia is in Europe.
30            Turkey is in Europe.
31    United Kingdom is in Europe.
Name: country, dtype: object

In [10]:
countries + 12

TypeError: can only concatenate str (not "int") to str

In [11]:
unemployment_rates = unemployment_df['unemp_rate']

In [12]:
avg_unemployment = unemployment_rates.mean()

#### Pandas is smart!
When possible, it will do the portion of what is asked that will prevent errors.

In [13]:
unemployment_df.mean()

unemp_rate    8.3375
dtype: float64

In [14]:
unemployment_sorted_asc = unemployment_df.sort_values('unemp_rate', ascending=True)

In [15]:
lowest_unemployment = unemployment_sorted_asc.head()

### Exercise - What is the average unemployment of the seven countries with the highest unemployment in europe?

In [16]:
# Sort the values of the unemployment_df - descending or ascending?
unemployment_sorted_desc = unemployment_df.sort_values('unemp_rate', ascending=False)
# Get the first seven rows in the returned series
highest_unemployment = unemployment_sorted_desc.head(7)
# Get the average of those rows
highest_unemployment_avg = highest_unemployment['unemp_rate'].mean()

#### Extra - explore these methods:
.min(), .max(), .sum(), .unique()

In [17]:
unemployment_rates.min()
unemployment_rates.max()
unemployment_rates.sum()
unemployment_rates.unique()

array([ 6. ,  7.8,  7.6,  5. , 13. ,  4. ,  4.1,  6.2,  6.8, 23.6, 19.6,
        8.8, 10.1, 13.1,  5.1,  8.4,  3. , 11.7,  7.9,  6.3,  9.6,  4.7,
       11.2,  5.9,  7. ,  8. ,  9.7, 10.9,  4.8])

## 2.1 Merging DataFrames

In [18]:
gdp_df = pd.read_csv('./data/gdp_2016.csv')

Let's create a new dataframe by merging two existing dataframes. This is the one we'll use for the rest of section 2.

In [19]:
eur_data = pd.merge(unemployment_df, gdp_df)

What other data can we include? Are there other file types that we can work with?

In [20]:
misc_data = pd.read_excel('./data/misc_data.xlsx')

In [21]:
misc_data_file = pd.ExcelFile('./data/misc_data.xlsx')
sheet_names = misc_data_file.sheet_names
?pd.read_excel

In [22]:
income_df = pd.read_excel('./data/misc_data.xlsx', "Income")

Let's merge this with our existing data.

In [23]:
eur_data = eur_data.merge(income_df)

In [24]:
pop_df = pd.read_excel('./data/misc_data.xlsx', 'Population', skiprows=3)

In [25]:
pop_df_col_names = pop_df.columns

In [26]:
total_pop = pop_df['total_pop']

In [27]:
eur_data = eur_data.merge(total_pop)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [28]:
total_pop_with_countries = pop_df[['country', 'total_pop']]

Pandas is smart, but it's not clairvoyant!

In [29]:
eur_data = pd.merge(eur_data, total_pop_with_countries)

In [30]:
eur_data_sorted = eur_data.sort_values('country')

It looks like there's an issue with our indexes. What is an index, anyway?

## 2.2 Indexes in Pandas

In [31]:
countries_dict = {
    15: {'country': 'Italy', 
         'unemp_rate': 11.7, 
         'gdp': 1689824.0, 
         'median_income': 16237, 
         'total_pop': 59433744
        }
}

In [32]:
countries_from_dict = pd.DataFrame.from_dict(countries_dict, orient='index')

In [33]:
eur_index = eur_data_sorted.index
type(eur_index)

pandas.core.indexes.numeric.Int64Index

Indexes are immutable. And for good reason...

In [34]:
eur_index[0] = 12

TypeError: Index does not support mutable operations

Dataframes can also be indexed by labels, rather than numbers.

In [35]:
eur_data_country_index = eur_data_sorted.set_index('country')

In some cases, it can be beneficial to reset the index of a dataframe. In this example, we do this for presentation purposes.

In [36]:
eur_data_sorted.reset_index(drop=True, inplace=True)

## 2.3 Multindexes
Pandas also supports multindexes, which allow users to index by multiple values or groups of values.

In [116]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
          ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

We want a multidimensional array of random numbers. Numpy for the win!

In [117]:
import numpy as np

In [118]:
md_array = np.random.randn(8,4)
# ?np.random.randn

In [119]:
multi_df = pd.DataFrame(md_array, index=arrays)

In [121]:
multi_df.loc['bar']

            0         1         2         3
one  0.446244 -2.268920  0.271520 -0.470366
two -0.733962  1.404548  0.393756  1.247237

### Exercise - Add a 'three' to two of the high-level indexes.
What else needs to change?

In [124]:
arrays = [['bar', 'bar', 'bar','baz', 'baz', 'foo', 'foo', 'foo', 'qux', 'qux'],
          ['one', 'two', 'three', 'one', 'two', 'one', 'two', 'three', 'one', 'two']]
md_array = np.random.randn(10,4)
multi_df = pd.DataFrame(md_array, index=arrays)

                  0         1         2         3
bar one   -0.356268 -0.331853  1.064124 -0.316832
    two    0.993039 -1.035902 -2.858564 -0.208426
    three -0.392032 -0.981434 -1.470886 -1.782379
baz one   -0.211087 -1.367823  1.336906  1.568830
    two    0.532331  1.891054  1.300656 -0.782066
foo one   -1.438357 -1.445084  0.641476 -0.659371
    two    0.791890  2.018852 -0.628746 -0.950751
    three -1.553159 -1.912308  0.324367 -0.170140
qux one    0.298811 -0.856737  1.569876  0.394337
    two   -0.010364  2.252228 -0.162405 -0.845902

### Exercise - Rename the columns

In [118]:
multi_df.columns = ['Awesomeness', 'Tangibility', 'Scrumtrelescence', 'Pean']

## 2.4 Creating files
Pandas has robust I/O functionality.

In [37]:
eur_data_sorted.to_csv('./data/out/eur_data_sorted.csv')

### Exercise - Write this dataframe to Excel,  JSON, and HTML
Google is your friend...

In [38]:
# Excel
eur_data_sorted.to_excel('./data/out/eur_data_sorted.xlsx')

In [39]:
# JSON - How would you view this file?
# What similarities does it have with csv and excel? What differences?
eur_data_sorted.to_json('./data/out/eur_data_sorted.json')

In [40]:
# HTML
eur_data_sorted.to_html('./data/out/eur_data_sorted.htm')

## 3.1 Working with DataFrames
Let's work with an existing dataframe that includes a lot of the same data from the previous sections.

In [41]:
eur_data_final = pd.read_csv('./data/final/eur_data_final.csv', index_col=0)

In [42]:
eur_data_final.head()

    country  unemp_rate       gdp  median_income  total_pop
0   Austria         6.0  356237.6          23071    8401940
1   Belgium         7.8  424660.3          21335   11000638
2  Bulgaria         7.6   48128.6           6742    7364570
3   Croatia        13.1   46639.5           8985    4284889
4    Cyprus        13.0   18490.2          16173     840407

In [43]:
eur_data_final.tail()

           country  unemp_rate        gdp  median_income  total_pop
27           Spain        19.6  1118743.0          15347   46815910
28          Sweden         7.0   463147.5          20955    9482855
29     Switzerland         5.0   605753.7          27692    7954662
30          Turkey        10.9   780224.9           6501    7954662
31  United Kingdom         4.8  2403382.6          17296   63182180

In [44]:
eur_data_final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32 entries, 0 to 31
Data columns (total 5 columns):
country          32 non-null object
unemp_rate       32 non-null float64
gdp              32 non-null float64
median_income    32 non-null int64
total_pop        32 non-null int64
dtypes: float64(2), int64(2), object(1)
memory usage: 1.5+ KB

In [45]:
eur_data_final.shape

(32, 5)

In [46]:
eur_data_final.describe()

       unemp_rate           gdp  median_income     total_pop
count   32.000000  3.200000e+01      32.000000  3.200000e+01
mean     8.337500  5.218333e+05   15972.343750  1.637612e+07
std      4.393378  7.781849e+05    6640.636617  2.198819e+07
min      3.000000  1.034410e+04    4724.000000  3.155560e+05
25%      5.700000  4.775632e+04   10190.500000  3.974524e+06
50%      7.300000  2.012768e+05   16205.000000  7.954662e+06
75%      9.800000  4.987990e+05   21161.250000  1.241443e+07
max     23.600000  3.159750e+06   28663.000000  8.021970e+07

In [47]:
eur_data_final.mean()

unemp_rate       8.337500e+00
gdp              5.218333e+05
median_income    1.597234e+04
total_pop        1.637612e+07
dtype: float64

## 3.2 What is boolean indexing?
First of all, what is the boolean data type? It is data type that represents one of two possible values. For example, True False, On Off, etc.

In [48]:
austria_bool = eur_data_final.country == 'Austria'

In [49]:
eur_data_final[austria_bool]

   country  unemp_rate       gdp  median_income  total_pop
0  Austria         6.0  356237.6          23071    8401940

In [50]:
# Bracket notation, as opposed to dot notation
greece_bool = eur_data_final['country'] == 'Greece'
eur_data_final[greece_bool]

   country  unemp_rate       gdp  median_income  total_pop
11  Greece        23.6  176487.9           9048   10816286

Queries can also be generated using partial matches.

In [51]:
l_names = eur_data_final.country.str.contains('l')

In [52]:
eur_data_final[l_names]

        country  unemp_rate        gdp  median_income  total_pop
1       Belgium         7.8   424660.3          21335   11000638
2      Bulgaria         7.6    48128.6           6742    7364570
8       Finland         8.8   216073.0          19997    5375276
13      Iceland         3.0    18646.1          22193     315556
14      Ireland         8.4   273238.2          18286    4574888
15        Italy        11.7  1689824.0          16237   59433744
19        Malta         4.7    10344.1          17264     417432
20  Netherlands         6.0   708337.0          21189   16655799
22       Poland         6.2   426547.5          10865   38044565
23     Portugal        11.2   186480.5          10805   10562178
25     Slovakia         9.7    81226.1          10466    5397036
26     Slovenia         8.0    40357.2          15250    2050189
29  Switzerland         5.0   605753.7          27692    7954662

What is missing?

In [53]:
l_names_insensitive = eur_data_final.country.str.contains('l', case=False)

In [54]:
eur_data_final[l_names_insensitive]

        country  unemp_rate        gdp  median_income  total_pop
1       Belgium         7.8   424660.3          21335   11000638
2      Bulgaria         7.6    48128.6           6742    7364570
8       Finland         8.8   216073.0          19997    5375276
13      Iceland         3.0    18646.1          22193     315556
14      Ireland         8.4   273238.2          18286    4574888
15        Italy        11.7  1689824.0          16237   59433744
16       Latvia         9.6    25037.7           9257    2070371
17    Lithuania         7.9    38849.4           9364    3043429
18   Luxembourg         6.3    53303.0          28663     512353
19        Malta         4.7    10344.1          17264     417432
20  Netherlands         6.0   708337.0          21189   16655799
22       Poland         6.2   426547.5          10865   38044565
23     Portugal        11.2   186480.5          10805   10562178
25     Slovakia         9.7    81226.1          10466    5397036
26     Slovenia         8.0    40357.2          15250    2050189
29  Switzerland         5.0   605753.7          27692    7954662

## 3.3 Multiple queries

In [55]:
low_unemployment = eur_data_final.unemp_rate < 7

In [56]:
eur_data_final[l_names_insensitive and low_unemployment]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [57]:
# In set theory, this is intersection.
eur_data_final[l_names_insensitive & low_unemployment]

        country  unemp_rate       gdp  median_income  total_pop
13      Iceland         3.0   18646.1          22193     315556
18   Luxembourg         6.3   53303.0          28663     512353
19        Malta         4.7   10344.1          17264     417432
20  Netherlands         6.0  708337.0          21189   16655799
22       Poland         6.2  426547.5          10865   38044565
29  Switzerland         5.0  605753.7          27692    7954662

In [58]:
# In set theory, this is union.
eur_data_final[l_names | low_unemployment]

           country  unemp_rate        gdp  median_income  total_pop
0          Austria         6.0   356237.6          23071    8401940
1          Belgium         7.8   424660.3          21335   11000638
2         Bulgaria         7.6    48128.6           6742    7364570
5          Czechia         4.0   176370.1          12478   10436560
6          Denmark         6.2   282089.9          21355    5560628
7          Estonia         6.8    21682.6          11867    1294455
8          Finland         8.8   216073.0          19997    5375276
10         Germany         4.1  3159750.0          21152   80219695
12         Hungary         5.1   113903.8           8267    9937628
13         Iceland         3.0    18646.1          22193     315556
14         Ireland         8.4   273238.2          18286    4574888
15           Italy        11.7  1689824.0          16237   59433744
18      Luxembourg         6.3    53303.0          28663     512353
19           Malta         4.7    10344.1          17264     417432
20     Netherlands         6.0   708337.0          21189   16655799
21          Norway         4.7   335747.5          27670    4979954
22          Poland         6.2   426547.5          10865   38044565
23        Portugal        11.2   186480.5          10805   10562178
24         Romania         5.9   170393.6           4724   20121641
25        Slovakia         9.7    81226.1          10466    5397036
26        Slovenia         8.0    40357.2          15250    2050189
29     Switzerland         5.0   605753.7          27692    7954662
31  United Kingdom         4.8  2403382.6          17296   63182180

In [59]:
# In set theory, this is complement
eur_data_final[~low_unemployment]

      country  unemp_rate        gdp  median_income  total_pop
1     Belgium         7.8   424660.3          21335   11000638
2    Bulgaria         7.6    48128.6           6742    7364570
3     Croatia        13.1    46639.5           8985    4284889
4      Cyprus        13.0    18490.2          16173     840407
8     Finland         8.8   216073.0          19997    5375276
9      France        10.1  2228568.0          20621   64933400
11     Greece        23.6   176487.9           9048   10816286
14    Ireland         8.4   273238.2          18286    4574888
15      Italy        11.7  1689824.0          16237   59433744
16     Latvia         9.6    25037.7           9257    2070371
17  Lithuania         7.9    38849.4           9364    3043429
23   Portugal        11.2   186480.5          10805   10562178
25   Slovakia         9.7    81226.1          10466    5397036
26   Slovenia         8.0    40357.2          15250    2050189
27      Spain        19.6  1118743.0          15347   46815910
28     Sweden         7.0   463147.5          20955    9482855
30     Turkey        10.9   780224.9           6501    7954662

### Exercise - What countries have an unemployment rate greater than 9% and a GDP less than 280000?

In [60]:
high_unemployment = eur_data_final.unemp_rate > 10
gdp_query = eur_data_final.gdp > 280000

In [61]:
eur_data_final[high_unemployment & gdp_query]

   country  unemp_rate        gdp  median_income  total_pop
9   France        10.1  2228568.0          20621   64933400
15   Italy        11.7  1689824.0          16237   59433744
27   Spain        19.6  1118743.0          15347   46815910
30  Turkey        10.9   780224.9           6501    7954662

### Exercise - What countries have a median_income between 10000 and 20000?

In [62]:
income_query = (eur_data_final.median_income > 10_000) & (eur_data_final.median_income < 20_000)

In [63]:
eur_data_final[income_query]

           country  unemp_rate        gdp  median_income  total_pop
4           Cyprus        13.0    18490.2          16173     840407
5          Czechia         4.0   176370.1          12478   10436560
7          Estonia         6.8    21682.6          11867    1294455
8          Finland         8.8   216073.0          19997    5375276
14         Ireland         8.4   273238.2          18286    4574888
15           Italy        11.7  1689824.0          16237   59433744
19           Malta         4.7    10344.1          17264     417432
22          Poland         6.2   426547.5          10865   38044565
23        Portugal        11.2   186480.5          10805   10562178
25        Slovakia         9.7    81226.1          10466    5397036
26        Slovenia         8.0    40357.2          15250    2050189
27           Spain        19.6  1118743.0          15347   46815910
31  United Kingdom         4.8  2403382.6          17296   63182180

In [64]:
# Alternative, using .between()
income_query_alt = eur_data_final.median_income.between(10_000, 20_000, inclusive=True)

In [65]:
eur_data_final[income_query_alt]

           country  unemp_rate        gdp  median_income  total_pop
4           Cyprus        13.0    18490.2          16173     840407
5          Czechia         4.0   176370.1          12478   10436560
7          Estonia         6.8    21682.6          11867    1294455
8          Finland         8.8   216073.0          19997    5375276
14         Ireland         8.4   273238.2          18286    4574888
15           Italy        11.7  1689824.0          16237   59433744
19           Malta         4.7    10344.1          17264     417432
22          Poland         6.2   426547.5          10865   38044565
23        Portugal        11.2   186480.5          10805   10562178
25        Slovakia         9.7    81226.1          10466    5397036
26        Slovenia         8.0    40357.2          15250    2050189
27           Spain        19.6  1118743.0          15347   46815910
31  United Kingdom         4.8  2403382.6          17296   63182180

## 3.4 Selection in Pandas
Using .loc(), .iloc()

In [66]:
countries_dict = {
    15: {'country': 'Italy', 
         'unemp_rate': 11.7, 
         'gdp': 1689824.0, 
         'median_income': 16237, 
         'total_pop': 59433744
        }
}

In [67]:
# With vanilla python, how do we get the word 'Italy' from a dictionary?
countries_dict[15]['country']

'Italy'

In [68]:
eur_data_final.loc[15, 'country']

'Italy'

.loc() is short for locate. It can be used a variety of different ways. In this example above, it functions like selecting from a grid. First row, then column...

In [69]:
eur_data_final.loc[12, 'gdp']

113903.8

Entire rows can also be returned...

In [70]:
eur_data_final.loc[12]

country          Hungary
unemp_rate           5.1
gdp               113904
median_income       8267
total_pop        9937628
Name: 12, dtype: object

...or multiples columns of a row...

In [71]:
eur_data_final.loc[8, ['gdp', 'total_pop']]

gdp           216073
total_pop    5375276
Name: 8, dtype: object

...or multiple rows and multiple columns.

In [72]:
eur_data_final.loc[[9,10], ['country','gdp']]

    country        gdp
9    France  2228568.0
10  Germany  3159750.0

In [75]:
eur_data_final.loc[9:14, ['country','gdp']]

    country        gdp
9    France  2228568.0
10  Germany  3159750.0
11   Greece   176487.9
12  Hungary   113903.8
13  Iceland    18646.1
14  Ireland   273238.2

In [146]:
eur_data_country_index.loc['Slovenia']

unemp_rate             8.0
gdp                40357.2
median_income      15250.0
total_pop        2050189.0
Name: Slovenia, dtype: float64

### Exercise - What countries have a higher unemployment rate than Slovenia and have a lowercase 't' in their name?

In [148]:
slovenia_unemployment = eur_data_country_index.loc['Slovenia', 'unemp_rate']
gt_slov = eur_data_final.unemp_rate > slovenia_unemployment
t_names = eur_data_final.country.str.contains('t')
eur_data_final[gt_slov & t_names]

     country  unemp_rate        gdp  median_income  total_pop
3    Croatia        13.1    46639.5           8985    4284889
15     Italy        11.7  1689824.0          16237   59433744
16    Latvia         9.6    25037.7           9257    2070371
23  Portugal        11.2   186480.5          10805   10562178